# На вход программе подается строка текста из натуральных чисел.
# Из элементов строки формируется список чисел.
# Напишите программу циклического сдвига элементов списка направо, когда последний элемент становится первым,
# а остальные сдвигаются на одну позицию вперед, в сторону увеличения индексов.

arr = [int(num) for num in input().split()]
arr.insert(0, arr[len(arr) - 1])
arr.pop()
print(*arr)
