# На вход программе подается строка. Напишите программу, которая определяет количество различных символов в строке.

string = input()
print(len(set(string)))
