# Код Морзе для представления цифр и букв использует тире и точки.
#
# Напишите программу для кодирования текстового сообщения в соответствии с кодом Морзе.
# new line

letters = [c for c in 'ABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789']
morse = ['.-', '-...', '-.-.', '-..', '.', '..-.', '--.', '....', '..', '.---', '-.-', '.-..', '--', '-.', '---',
         '.--.', '--.-', '.-.', '...', '-', '..-', '...-', '.--', '-..-', '-.--', '--..', '-----', '.----', '..---',
         '...--', '....-', '.....', '-....', '--...', '---..', '----.']
dict_morse = dict(zip(letters, morse))

message = input().upper()
print(message)
for ch in message:
    if ch in dict_morse.keys():
        print(dict_morse[ch], end=' ')
